src/InformationRegisters/ИсторияЗапросовУМТО/ИсторияЗапросовУМТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЗапросовУМТО</name>
  <resources>
    <name>ДатаЗапроса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрыЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОбработкиЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсторияЗапросовУМТО/ManagerModule.bsl
//////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СоздатьЗаписьИстории(ПараметрыЗаписи = Неопределено) Экспорт
	
	Результат = РегистрыСведений.ИсторияЗапросовУМТО.СоздатьМенеджерЗаписи();
	Результат.Идентификатор 	= Новый УникальныйИдентификатор;
	Результат.ДатаЗапроса 		= ТекущаяДатаСеанса();
	
	Если Не ПараметрыЗаписи = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, ПараметрыЗаписи);
	КонецЕсли; // Если Не ПараметрыЗаписи = Неопределено Тогда
	
	Результат.Записать();
	
	Возврат	Результат.Идентификатор;
	
КонецФункции // СоздатьЗаписьИстории

Процедура ЗафиксироватьПараметрЗаписи(ИдентификаторЗаписи, ИмяПараметра, ЗначениеПараметра) Экспорт
	
	ЗаписьИстории = РегистрыСведений.ИсторияЗапросовУМТО.СоздатьМенеджерЗаписи();
	ЗаписьИстории.Идентификатор = ИдентификаторЗаписи; 
	ЗаписьИстории.Прочитать();
	
	Если Не ЗаписьИстории.Выбран() Тогда
		ЗаписьИстории.Идентификатор = ИдентификаторЗаписи; 
	КонецЕсли; // Если Не ЗаписьИстории.Выбран() Тогда
	
	ЗаписьИстории[ИмяПараметра] = ЗначениеПараметра;
	ЗаписьИстории.Записать();
	
КонецПроцедуры // ЗафиксироватьПараметрЗаписи

Функция ОбновитьЗапись(Идентификатор, ПараметрыЗаписи) Экспорт
	Запись 					= РегистрыСведений.ИсторияЗапросовУМТО.СоздатьМенеджерЗаписи();
	Запись.Идентификатор 	= Идентификатор;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли; // Если Не Запись.Выбран() Тогда
	
	Для Каждого Ресурс Из Метаданные.РегистрыСведений.ИсторияЗапросовУМТО.Ресурсы Цикл
		Если ПараметрыЗаписи.Свойство(Ресурс.Имя) Тогда
			Запись[Ресурс.Имя] = ПараметрыЗаписи[Ресурс.Имя];
		КонецЕсли; // Если ПараметрыЗаписи.Свойство(Ресурс.Имя) Тогда		
	КонецЦикла; // 	Для Каждого Ресурс Из Метаданные.РегистрыСведений.ИсторияЗапросовУМТО.Ресурсы Цикл
	
	Запись.Записать();
	Возврат Истина;
КонецФункции // ОбновитьЗапись
